{
    "Course Title": "Phys999: The Physics of Food",
    "Course Syllabus": "**Course Title: PHYS 999 - The Physics of Food**\n## Course Description:\nThis course delves into the fascinating intersection of physics and the culinary world. Students will explore the physical principles underlying food preparation, cooking techniques, and the science behind various culinary processes. Topics include heat transfer, fluid dynamics in food, molecular gastronomy, and the physics of taste. Emphasis will be placed on both theoretical concepts and hands-on experiments.\n## Learning Objectives:\n1. **Foundational Principles:** Develop a strong foundation in the physics principles relevant to food and cooking.\n2. **Hands-on Experimentation:** Apply physics concepts through hands-on experiments and kitchen activities.\n3. **Culinary Science:** Understand the science behind various cooking techniques and their impact on food.\n4. **Innovation and Creativity:** Explore the innovative and creative aspects of molecular gastronomy.\n5. **Real-World Applications:** Connect physics principles to real-world culinary scenarios.\n## Texts:\n1. **\"On Food and Cooking: The Science and Lore of the Kitchen\"** by Harold McGee\n2. **Supplementary Reading Materials and Online Resources**\n## Grading:\n- **Lab Reports and Kitchen Experiments:** 20%\n- **Physics of Food Project:** 20%\n- **Midterm Exam:** 30%\n- **Final Exam:** 25%\n- **Class Participation and Attendance:** 5%\n## Weekly Schedule:\n**Week 1-2: Introduction to the Physics of Cooking**\n- Overview of physics principles in culinary science\n- Introduction to heat transfer and its role in cooking\n**Week 3-5: Fluid Dynamics in Food**\n- Understanding the role of fluids in food preparation\n- Experimentation with viscosity and flow in cooking\n**Week 6-8: Molecular Gastronomy**\n- Exploration of the science behind modernist cuisine\n- Hands-on molecular gastronomy experiments\n**Week 9-11: Taste and Flavor Physics**\n- Understanding the physics of taste and flavor\n- Experimentation with sensory perception\n**Week 12-14: Physics of Baking and Pastry**\n- Application of physics principles in baking\n- Hands-on experiments in pastry making\n**Week 15: Final Exam Review**\n## Course Policies:\n- Regular attendance is expected.\n- Active participation in kitchen experiments is crucial.\n- Lab reports and project submissions should adhere to specified deadlines.\n- Academic honesty and integrity are essential in all experiments and assessments.\n## Note:\nThis syllabus is subject to change at the discretion of the instructor. Students will be notified of any modifications in advance.",
    "Grade Breakdown": {
      "Lab Reports and Kitchen Experiments": 0.2,
      "Physics of Food Project": 0.2,
      "Midterm Exam": 0.3,
      "Final Exam": 0.25,
      "Class Participation and Attendance": 0.05
    },
    "Enrolled Students": ["1001", "1002"]
}
