{
    "Assignments": {
      "HW1": {
        "Title": "Limits Exploration",
        "Description": "Explore the concept of limits by examining a variety of mathematical functions. Identify and analyze limits graphically and algebraically. Discuss the behavior of functions as they approach certain values. Provide real-world examples where limits are encountered. This assignment aims to solidify your understanding of the foundational concept of limits.",
        "Due Date": "2023-09-15"
      },
      "HW2": {
        "Title": "Derivative Applications in the Real World",
        "Description": "Investigate and apply the concept of derivatives to real-world scenarios. Choose a practical problem that involves rates of change or optimization. Use differentiation to solve the problem, and present your solution along with a clear explanation of the calculus involved. This assignment emphasizes the application of derivative concepts to solve tangible problems.",
        "Due Date": "2023-10-15"
      },
      "HW3": {
        "Title": "Integration and Area Approximation",
        "Description": "Explore the relationship between integration and the calculation of areas. Select a geometric figure or a real-world scenario and use integration to approximate the area under a curve. Justify your methodology and discuss any challenges encountered. This assignment aims to deepen your understanding of definite integrals and their geometric interpretation.",
        "Due Date": "2023-11-15"
      },
      "HW4": {
        "Title": "Sequences and Series Analysis",
        "Description": "Investigate and analyze sequences and series in a mathematical context. Choose a specific mathematical sequence or series and explore its convergence or divergence. Apply convergence tests and discuss the implications of your findings. This assignment aims to enhance your understanding of infinite mathematical structures and their behavior.",
        "Due Date": "2023-12-15"
      }
    },
    "Grades": {
        "HW1": {
          "1001": 1.0,
          "1003": 0.85
        },
        "HW2": {
          "1001": 1.0,
          "1003": 0.90
        },
        "HW3": {
          "1001": 1.0,
          "1003": 0.80
        },
        "HW4": {

        },
        "Midterm 1": {
          "1001": 0.9,
          "1003": 0.88
        },
        "Midterm 2": {
          "1001": 0.9,
          "1003": 0.77
        },
        "Final": {
  
        }
      },
    "Exams": {
      "Midterm 1": {
        "Date": "2023-10-15"
      },
      "Midterm 2": {
        "Date": "2023-11-15"
      },
      "Final": {
        "Date": "2023-12-22"
      }
    }
  }